In [3]:
pip install pandas

Requirement already satisfied: pandas in c:\program files\python311\lib\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.23.2 in c:\program files\python311\lib\site-packages (from pandas) (2.2.5)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\program files\python311\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\program files\python311\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\program files\python311\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\program files\python311\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip available: 22.3 -> 25.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [44]:
import pandas as pd 

sa = pd.read_csv("C:/Users/Administrator/Downloads/nyc_weather.csv")
sa.head(10)
sa.tail(30)

,EST,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees
1,1/2/2016,36,18,46,30.02,10,7.0,0,3,NaN,275
2,1/3/2016,40,21,47,29.86,10,8.0,0,1,NaN,277
3,1/4/2016,25,9,44,30.05,10,9.0,0,3,NaN,345
4,1/5/2016,20,-3,41,30.57,10,5.0,0,0,NaN,333
5,1/6/2016,33,4,35,30.50,10,4.0,0,0,NaN,259
6,1/7/2016,39,11,33,30.28,10,2.0,0,3,NaN,293
7,1/8/2016,39,29,64,30.20,10,4.0,0,8,NaN,79
8,1/9/2016,44,38,77,30.16,9,8.0,T,8,Rain,76
9,1/10/2016,50,46,71,29.59,4,NaN,1.8,7,Rain,109
10,1/11/2016,33,8,37,29.92,10,NaN,0,1,NaN,289
11,1/12/2016,35,15,53,29.85,10,6.0,T,4,NaN,235
12,1/13/2016,26,4,42,29.94,10,10.0,0,0,NaN,284
13,1/14/2016,30,12,47,29.95,10,5.0,T,7,NaN,266
14,1/15/2016,43,31,62,29.82,9,5.0,T,2,NaN,101
15,1/16/2016,47,37,70,29.52,8,7.0,0.24,7,Rain,340
16,1/17/2016,36,23,66,29.78,8,6.0,0.05,6,Fog-Snow,345
17,1/18/2016,25,6,53,29.83,9,12.0,T,2,Snow,293
18,1/19/2016,22,3,42,30.03,10,11.0,0,1,NaN,293
19,1/20/2016,32,15,49,30.13,10,6.0,0,2,NaN,302
20,1/21/2016,31,11,45,30.15,10,6.0,0,1,NaN,312
21,1/22/2016,26,6,41,30.21,9,NaN,0.01,3,Snow,34
22,1/23/2016,26,21,78,29.77,1,16.0,2.31,8,Fog-Snow,42
23,1/24/2016,28,11,53,29.92,8,6.0,T,3,Snow,327
24,1/25/2016,34,18,54,30.25,10,3.0,0,2,NaN,286
25,1/26/2016,43,29,56,30.03,10,7.0,0,2,NaN,244
26,1/27/2016,41,22,45,30.03,10,7.0,T,3,Rain,311
27,1/28/2016,37,20,51,29.90,10,5.0,0,1,NaN,234
28,1/29/2016,36,21,50,29.58,10,8.0,0,4,NaN,298
29,1/30/2016,34,16,46,30.01,10,7.0,0,0,NaN,257
30,1/31/2016,46,28,52,29.90,10,5.0,0,0,NaN,241

In [45]:
sa.Events

0          NaN
1          NaN
2          NaN
3          NaN
4          NaN
5          NaN
6          NaN
7          NaN
8         Rain
9         Rain
10         NaN
11         NaN
12         NaN
13         NaN
14         NaN
15        Rain
16    Fog-Snow
17        Snow
18         NaN
19         NaN
20         NaN
21        Snow
22    Fog-Snow
23        Snow
24         NaN
25         NaN
26        Rain
27         NaN
28         NaN
29         NaN
30         NaN
Name: Events, dtype: object

In [7]:
sa.Humidity

0     52
1     46
2     47
3     44
4     41
5     35
6     33
7     64
8     77
9     71
10    37
11    53
12    42
13    47
14    62
15    70
16    66
17    53
18    42
19    49
20    45
21    41
22    78
23    53
24    54
25    56
26    45
27    51
28    50
29    46
30    52
Name: Humidity, dtype: int64

In [7]:
sa.columns

Index(['EST', 'Temperature', 'DewPoint', 'Humidity', 'Sea Level PressureIn',
       'VisibilityMiles', 'WindSpeedMPH', 'PrecipitationIn', 'CloudCover',
       'Events', 'WindDirDegrees'],
      dtype='object')

In [13]:
sa.count()

EST                     31
Temperature             31
DewPoint                31
Humidity                31
Sea Level PressureIn    31
VisibilityMiles         31
WindSpeedMPH            28
PrecipitationIn         31
CloudCover              31
Events                   9
WindDirDegrees          31
dtype: int64

In [14]:
sa.Temperature.count()

np.int64(31)

In [12]:
sa.describe()

,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,CloudCover,WindDirDegrees
count,31.000000,31.000000,31.000000,31.000000,31.000000,28.000000,31.000000,31.000000
mean,34.677419,17.838710,51.677419,29.992903,9.193548,6.892857,3.129032,247.129032
std,7.639315,11.378626,11.634395,0.237237,1.939405,2.871821,2.629853,92.308086
min,20.000000,-3.000000,33.000000,29.520000,1.000000,2.000000,0.000000,34.000000
25%,29.000000,10.000000,44.500000,29.855000,9.000000,5.000000,1.000000,238.000000
50%,35.000000,18.000000,50.000000,30.010000,10.000000,6.500000,3.000000,281.000000
75%,39.500000,23.000000,55.000000,30.140000,10.000000,8.000000,4.500000,300.000000
max,50.000000,46.000000,78.000000,30.570000,10.000000,16.000000,8.000000,345.000000

In [16]:
sa.shape

(31, 11)

In [18]:
# showing nan value and non nan value
sa.WindSpeedMPH

0      8.0
1      7.0
2      8.0
3      9.0
4      5.0
5      4.0
6      2.0
7      4.0
8      8.0
9      NaN
10     NaN
11     6.0
12    10.0
13     5.0
14     5.0
15     7.0
16     6.0
17    12.0
18    11.0
19     6.0
20     6.0
21     NaN
22    16.0
23     6.0
24     3.0
25     7.0
26     7.0
27     5.0
28     8.0
29     7.0
30     5.0
Name: WindSpeedMPH, dtype: float64

In [20]:
sa.WindSpeedMPH.isna()

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9      True
10     True
11    False
12    False
13    False
14    False
15    False
16    False
17    False
18    False
19    False
20    False
21     True
22    False
23    False
24    False
25    False
26    False
27    False
28    False
29    False
30    False
Name: WindSpeedMPH, dtype: bool

In [22]:
sa.dtypes

EST                      object
Temperature               int64
DewPoint                  int64
Humidity                  int64
Sea Level PressureIn    float64
VisibilityMiles           int64
WindSpeedMPH            float64
PrecipitationIn          object
CloudCover                int64
Events                   object
WindDirDegrees            int64
dtype: object

In [23]:
sa.Events.unique()

array([nan, 'Rain', 'Fog-Snow', 'Snow'], dtype=object)

In [24]:
sa.Events.describe()

count        9
unique       3
top       Rain
freq         4
Name: Events, dtype: object

In [25]:
sa.Events

0          NaN
1          NaN
2          NaN
3          NaN
4          NaN
5          NaN
6          NaN
7          NaN
8         Rain
9         Rain
10         NaN
11         NaN
12         NaN
13         NaN
14         NaN
15        Rain
16    Fog-Snow
17        Snow
18         NaN
19         NaN
20         NaN
21        Snow
22    Fog-Snow
23        Snow
24         NaN
25         NaN
26        Rain
27         NaN
28         NaN
29         NaN
30         NaN
Name: Events, dtype: object

In [26]:
sa['Temperature'].max()

np.int64(50)

In [28]:
sa['Temperature'].min()

np.int64(20)

In [29]:
sa.Temperature.min()

np.int64(20)

In [31]:
sa1 = sa['Temperature']>30
sa1

0      True
1      True
2      True
3     False
4     False
5      True
6      True
7      True
8      True
9      True
10     True
11     True
12    False
13    False
14     True
15     True
16     True
17    False
18    False
19     True
20     True
21    False
22    False
23    False
24     True
25     True
26     True
27     True
28     True
29     True
30     True
Name: Temperature, dtype: bool

In [32]:
sa1.sum()

np.int64(22)

In [42]:
sa1.head(8)

0     True
1     True
2     True
3    False
4    False
5     True
6     True
7     True
Name: Temperature, dtype: bool

In [35]:
sa['EST'][sa['Events']=='Rain']

8      1/9/2016
9     1/10/2016
15    1/16/2016
26    1/27/2016
Name: EST, dtype: object

In [37]:
sa['EST'][sa['Humidity']==70]

15    1/16/2016
Name: EST, dtype: object

In [38]:
sa['EST'][sa['Humidity']>=70]

8      1/9/2016
9     1/10/2016
15    1/16/2016
22    1/23/2016
Name: EST, dtype: object

In [41]:
sa['Events'][sa['WindSpeedMPH']==7.0]

1      NaN
15    Rain
25     NaN
26    Rain
29     NaN
Name: Events, dtype: object

In [46]:
sa['WindSpeedMPH'][sa['WindSpeedMPH'].isna()]

9    NaN
10   NaN
21   NaN
Name: WindSpeedMPH, dtype: float64

In [8]:
#data structure used in pandas -> series,dataframe
#1.Series
sa = [10,20,30,40,50]
a = pd.Series(sa)
print(a,type(a))

0    10
1    20
2    30
3    40
4    50
dtype: int64 <class 'pandas.core.series.Series'>

In [50]:
sa = [1,2,3]
a = pd.Series(sa,index=['1st',2,'3rd'],name='d1')
print(a)

1st    1
2      2
3rd    3
Name: d1, dtype: int64

In [54]:
sa = pd.Series([10,20,30,40,50,60])
print(sa,(type(sa)))

0    10
1    20
2    30
3    40
4    50
5    60
dtype: int64 <class 'pandas.core.series.Series'>

In [55]:
print(sa.loc[0:4])

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [57]:
sa = [10,20,30,40,50,60]
a = pd.Series(sa,dtype="float")
print(a,type(a))

0    10.0
1    20.0
2    30.0
3    40.0
4    50.0
5    60.0
dtype: float64 <class 'pandas.core.series.Series'>

In [58]:
a[4]

np.float64(50.0)

In [60]:
a.shape

(6,)

In [61]:
sa = [1,"Amina",45.6,"science"]
print(sa)

[1, 'Amina', 45.6, 'science']

In [64]:
s = pd.Series(sa,index=["rollno","name","mark","sub"])
print(s,type(s))
s['name']

rollno          1
name        Amina
mark         45.6
sub       science
dtype: object <class 'pandas.core.series.Series'>

'Amina'

In [65]:
d1 = {"sub1":"maths","sub2":"science","sub3":"python","sub4":"java"}
print(d1,type(d1))

{'sub1': 'maths', 'sub2': 'science', 'sub3': 'python', 'sub4': 'java'} <class 'dict'>

In [66]:
d1.items()

dict_items([('sub1', 'maths'), ('sub2', 'science'), ('sub3', 'python'), ('sub4', 'java')])

In [67]:
d1.keys()

dict_keys(['sub1', 'sub2', 'sub3', 'sub4'])

In [68]:
d1.values()

dict_values(['maths', 'science', 'python', 'java'])

In [69]:
d1 = {"sub1":"maths","sub2":"science","sub3":"python","sub4":"java"}
s=pd.Series(d1)
print(s,type(s))

sub1      maths
sub2    science
sub3     python
sub4       java
dtype: object <class 'pandas.core.series.Series'>

In [70]:
s['sub3']

'python'

In [71]:
l1 = [[0,1,2,3],[4,5,6,7],[10,20,30,40]]
sa = pd.Series(l1)
print(sa)

0        [0, 1, 2, 3]
1        [4, 5, 6, 7]
2    [10, 20, 30, 40]
dtype: object

In [73]:
l1 =[[10,"Amina"],[20,"Aziya"],[30,"Devu"],[40,"Achu"]]
sa = pd.DataFrame(l1)
print(sa)

    0      1
0  10  Amina
1  20  Aziya
2  30   Devu
3  40   Achu

In [74]:
sa.iloc[1:,:]

    0      1
1  20  Aziya
2  30   Devu
3  40   Achu

In [13]:
sa.iloc[2,1]

'Devu'

In [9]:
l1 =[[10,"Amina"],[20,"Aziya"],[30,"Devu"],[40,"Achu"]]
sa = pd.DataFrame(l1,columns=["Rno","Name"],index=["1st","second",3,"4th"])
print(sa,type(sa))

        Rno   Name
1st      10  Amina
second   20  Aziya
3        30   Devu
4th      40   Achu <class 'pandas.core.frame.DataFrame'>

In [11]:
sa.loc["1st","Name"]

'Amina'

In [14]:
tupl = (("Amina",24),("Aziya",22),("Achu",16),("Ansu",27))
sa = pd.DataFrame(tupl,index=[1,2,"#",5],columns=["Name","Age"])
print(sa)

    Name  Age
1  Amina   24
2  Aziya   22
#   Achu   16
5   Ansu   27

In [16]:
sa['gender']=["F","F","M","F"]
print(sa)

    Name  Age gender
1  Amina   24      F
2  Aziya   22      F
#   Achu   16      M
5   Ansu   27      F

In [18]:
sa.drop('gender',axis=1,inplace=True)

In [19]:
print(sa)

    Name  Age
1  Amina   24
2  Aziya   22
#   Achu   16
5   Ansu   27

In [20]:
data = {"Names":["Amina","Aziya","Achu","Ansi"],"Ages":[24,22,16,27],"gender":["F","F","M","F"]}
print(data)

{'Names': ['Amina', 'Aziya', 'Achu', 'Ansi'], 'Ages': [24, 22, 16, 27], 'gender': ['F', 'F', 'M', 'F']}

In [21]:
sa = pd.DataFrame(data)
print(sa)

   Names  Ages gender
0  Amina    24      F
1  Aziya    22      F
2   Achu    16      M
3   Ansi    27      F

In [22]:
data = [10,20,30,40,50]
sa=pd.Series(data)
print(sa)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [23]:
sa = pd.DataFrame(data,columns=["Marks"])
print(sa)

   Marks
0     10
1     20
2     30
3     40
4     50

In [24]:
sa.shape

(5, 1)

In [25]:
type(sa)

pandas.core.frame.DataFrame

In [27]:
data=pd.Series([10,20,30,40,50])
sa = pd.DataFrame(data,columns=["Marks"])
print(sa)

   Marks
0     10
1     20
2     30
3     40
4     50

In [29]:
lis1 = {"extmark":[100,150,120,200],"intMarks":[85,87,60,74]}
sa = pd.DataFrame(lis1,index=[1,2,3,4])
print(sa)

   extmark  intMarks
1      100        85
2      150        87
3      120        60
4      200        74

In [32]:
#adding new col to dataframe
sa["sum"]=sa["extmark"]+sa["intMarks"]
sa

   extmark  intMarks  sum
1      100        85  185
2      150        87  237
3      120        60  180
4      200        74  274

In [33]:
sa["sub"]=sa["extmark"] - sa["intMarks"]
sa

   extmark  intMarks  sum  sub
1      100        85  185   15
2      150        87  237   63
3      120        60  180   60
4      200        74  274  126

In [38]:
sa["Subject"] = ["python","java","dotnet","angular",]
sa

   Roll_no  Subject  extmark  intMarks  sum  sub
1        1   python      100        85  185   15
2        2     java      150        87  237   63
3        3   dotnet      120        60  180   60
4        4  angular      200        74  274  126

In [35]:
sa["Roll_no"] = range(1,5)
sa

   extmark  intMarks  sum  sub  Subject  Roll_no
1      100        85  185   15   python        1
2      150        87  237   63     java        2
3      120        60  180   60   dotnet        3
4      200        74  274  126  angular        4

In [36]:
sa = sa[["Roll_no","Subject","extmark","intMarks","sum","sub"]]
sa

   Roll_no  Subject  extmark  intMarks  sum  sub
1        1   python      100        85  185   15
2        2     java      150        87  237   63
3        3   dotnet      120        60  180   60
4        4  angular      200        74  274  126

In [39]:
sa = sa.sort_values(["Subject"],ascending=True)
sa

   Roll_no  Subject  extmark  intMarks  sum  sub
4        4  angular      200        74  274  126
3        3   dotnet      120        60  180   60
2        2     java      150        87  237   63
1        1   python      100        85  185   15

In [41]:
sa = sa.sort_values(["extmark"],ascending=False)
sa

   Roll_no  Subject  extmark  intMarks  sum  sub
4        4  angular      200        74  274  126
2        2     java      150        87  237   63
3        3   dotnet      120        60  180   60
1        1   python      100        85  185   15